{
  "objectives": [
    {
      "id": 1,
      "title": "Platform 3.5",
      "created": "2019-06-15T16:17:53+0000",
      "type": "Performance",
      "deadline": "Dec 2020",
      "status": "Pending Approval",
      "user-id": "d667f86e-51e0-44f6-90f3-a77acac22a6a",
      "role": "Performance Team Manager",
      "description": "Appropriately leverage existing market positioning results whereas technically sound materials. Efficiently develop fully tested technologies with end-to-end expertise. Globally iterate 24/7 markets and high standards.",
      "history": [{
        "date": "2019-06-15T16:17:53+0000",
        "action": "Objective Created",
        "triggered-by": "d667f86e-51e0-44f6-90f3-a77acac22a6a"
      },
      {
        "date": "2019-06-15T16:17:58+0000",
        "action": "Objective status set to: Pending Approval",
        "triggered-by": "d667f86e-51e0-44f6-90f3-a77acac22a6a"
      }]
    },
    {
      "id": 2,
      "title": "Team Manager Professional",
      "created": "2019-06-15T17:17:53+0000",
      "type": "Development",
      "deadline": "Dec 2020",
      "status": "To Start",
      "user-id": "d667f86e-51e0-44f6-90f3-a77acac22a6a",
      "role": "Performance Team Manager",
      "description": "Progressively maintain enabled innovation with B2C leadership skills. Phosfluorescently re-engineer premium interfaces and exceptional applications. Seamlessly negotiate global content for user-centric schemas. Objectively syndicate installed base e-services before sustainable infomediaries. Seamlessly actualize flexible infomediaries vis-a-vis superior growth strategies.\n\n      Uniquely conceptualize multimedia based alignments through impactful markets. Distinctively mesh B2B sources vis-a-vis cost effective potentialities. Dynamically create economically sound opportunities and functionalized potentialities. Objectively facilitate prospective outsourcing and high standards in platforms. Professionally transform vertical core competencies vis-a-vis goal-oriented schemas.\n      \n      Seamlessly seize client-centered channels without just in time internal or \"organic\" sources. Energistically plagiarize ubiquitous portals before clicks-and-mortar e-commerce. Intrinsicly administrate vertical e-business before exceptional outsourcing. Enthusiastically provide access to functional deliverables vis-a-vis one-to-one relationships. Holisticly strategize user-centric services without real-time portals.\n      \n      Proactively maintain focused vortals without open-source platforms. Collaboratively procrastinate seamless.",
      "history": [{
        "date": "2019-06-15T17:17:53+0000",
        "action": "Objective Created",
        "triggered-by": "d667f86e-51e0-44f6-90f3-a77acac22a6a"
      },
      {
        "date": "2019-06-15T17:17:54+0000",
        "time": "13:45",
        "action": "Objective status set to: Pending Approval",
        "triggered-by": "d667f86e-51e0-44f6-90f3-a77acac22a6a"
      },
      {
        "date": "2019-06-16T18:17:00+0000",
        "time": "09:45",
        "action": "Objective Approved",
        "triggered-by": "edb60e2c-f9d7-4cdc-b29c-381c604f70f2"
      },
      {
        "date": "2019-06-17T18:27:23+0000",
        "time": "09:45",
        "action": "Objective status set to: To Start",
        "triggered-by": "edb60e2c-f9d7-4cdc-b29c-381c604f70f2"
      }]
    },
    {
      "id": 3,
      "title": "GDPR",
      "created": "02/12/2018",
      "type": "Compliance Course",
      "deadline": "Mar 2020",
      "status": "To Start",
      "user-id": "d667f86e-51e0-44f6-90f3-a77acac22a6a",
      "role": "Performance Team Manager",
      "description": "Dramatically disseminate collaborative platforms through high-payoff imperatives. Uniquely orchestrate flexible expertise after state of the art convergence. Conveniently orchestrate customer directed meta-services without proactive metrics. Synergistically incentivize client-centric e-commerce for installed base web-readiness. Seamlessly morph interdependent expertise after error-free communities.\n\nCompletely integrate effective information whereas excellent internal or \"organic\" sources. Objectively enhance transparent mindshare through intermandated solutions. Assertively matrix best-of-breed infomediaries vis-a-vis efficient internal or \"organic\" sources. Conveniently underwhelm frictionless markets rather than reliable processes. Phosfluorescently."
    },
    {
      "id": 4,
      "title": "UX Training",
      "created": "05/06/2019",
      "type": "Development",
      "deadline": "Nov 2020",
      "status": "In progress",
      "user-id": "d667f86e-51e0-44f6-90f3-a77acac22a6a",
      "role": "Performance Team Manager",
      "description": "Quickly drive web-enabled vortals without progressive infomediaries. Synergistically matrix flexible applications rather than corporate action items. Professionally negotiate B2B synergy whereas customer directed niches. Dramatically reconceptualize just in time."
    },
    {
      "id": 5,
      "title": "Admiral Talent Mapping",
      "created": "01/06/2019",
      "type": "Performance",
      "deadline": "Oct 2020",
      "status": "Cancelled",
      "user-id": "d667f86e-51e0-44f6-90f3-a77acac22a6a",
      "role": "Performance Team Manager",
      "description": "Proactively productivate viral opportunities via enabled experiences. Enthusiastically matrix clicks-and-mortar outsourcing rather than high-quality leadership. Authoritatively monetize sustainable services for real-time expertise. Rapidiously communicate client-focused relationships with vertical value. Proactively mesh transparent users and customer directed niches.\n\nAppropriately utilize next-generation architectures for intuitive testing procedures. Uniquely parallel task stand-alone architectures via business ideas. Continually formulate maintainable models for adaptive results. Authoritatively evisculate high standards in web services before sticky e-markets. Seamlessly create accurate mindshare rather than progressive potentialities.\n\nDistinctively provide access to interoperable relationships for frictionless e-tailers. Efficiently foster B2C initiatives and long-term high-impact communities. Assertively myocardinate fully tested imperatives vis-a-vis principle-centered infomediaries. Monotonectally repurpose future-proof architectures for compelling relationships. Energistically supply multimedia based human capital after B2B infrastructures.\n\nSeamlessly visualize backend total linkage and wireless partnerships. Energistically re-engineer cross-unit networks with end-to-end products. Efficiently syndicate technically sound sources with future-proof synergy. Authoritatively visualize reliable alignments rather than 24/365 content. Appropriately target enabled supply chains through robust niches.\n\nObjectively optimize inexpensive imperatives after global collaboration and idea-sharing. Monotonectally mesh economically sound niches vis-a-vis multifunctional data. Collaboratively architect best-of-breed meta-services rather than interdependent interfaces. Uniquely exploit magnetic manufactured products without viral alignments. Compellingly productivate premier methodologies rather than interdependent markets.\n\nConveniently maximize high standards in."
    },
    {
      "id": 6,
      "title": "Senior Management Conference",
      "created": "17/01/2019",
      "type": "Performance",
      "deadline": "Feb 2020",
      "status": "Completed",
      "user-id": "d667f86e-51e0-44f6-90f3-a77acac22a6a",
      "role": "Performance Team Manager",
      "description": "Credibly underwhelm inexpensive value without long-term high-impact leadership skills. Rapidiously architect granular catalysts for change whereas just in time experiences. Rapidiously target business infomediaries after fully researched internal or \"organic\" sources. Continually disseminate scalable applications via functionalized e-tailers. Professionally develop performance based total linkage before."
    }
  ],
  "users": [
    {
      "id": "d667f86e-51e0-44f6-90f3-a77acac22a6a",
      "firstname": "Lisa",
      "lastname": "Writer",
      "job-title": "Performance Team Manager",
      "department": "Performance Management",
      "job-family": "People Management",
      "performance_review": "2019-10-15T16:17:53+0000",
      "reports-to": "32ec9d8c-5e56-433c-b99e-3d3fa1185c7b",
      "avatar": "https://i.pravatar.cc/180?img=10"
    }
  ],
  "tasks": [
    {
      "id": 1,
      "action": "Performance Review",
      "for-user-id": "bdd06338-d13e-4d81-9819-e0650ee4bf06",
      "due": "2019-12-15T16:17:53+0000",
      "state": "Overdue",
      "user-id": "532ecc3f-15f3-41ad-8883-1d86b78b2126"
    },
    {
      "id": 2,
      "action": "Performance Review",
      "for-user-id": "513bb8e9-2333-4c35-9936-a13db28e0910",
      "due": "2020-04-15T16:17:53+0000",
      "state": "To Start",
      "user-id": "d667f86e-51e0-44f6-90f3-a77acac22a6a"
    }
  ]
}